In [1]:
import pandas as pd

In [5]:
df = pd.read_csv('../data/world_cities.csv')
df.head(3)

   Unnamed: 0 City / Urban area    Country  Population  Land area (in sqKm)
0           0      Buenos Aires  Argentina    11200000                 2266
1           1         Melbourne  Australia     3162000                 2080
2           2            Sydney  Australia     3502000                 1687

질문 1. 여행을 좋아하는 익중이는 여행지를 알아보고 있습니다. 주어진 데이터에는 총 몇 개의 도시와 몇 개의 나라가 있는지 알아맞혀 보세요.
답안은 도시/나라 형식으로 숫자만 입력해 주세요. (예시: 156/77)

In [6]:
df['Country'].describe()

count     249
unique     61
top       USA
freq      105
Name: Country, dtype: object

In [7]:
df['City / Urban area'].describe()

count              249
unique             249
top       Buenos Aires
freq                 1
Name: City / Urban area, dtype: object

질문2. 사람 만나기를 좋아하는 익중이는 가장 사람이 붐비는 도시로 여행을 가기로 마음 먹었습니다. 주어진 데이터에서, 인구 밀도(명/sqKm) 가 10000 이 넘는 도시는 총 몇 개인지 알아보세요.
참고로 인구 밀도는 인구 수 / 땅의 면적 (in sqKm) 로 구할 수 있습니다.
답안은 숫자로만 입력해 주세요. (예시: 24)

In [14]:
df[df['Population']/df['Land area (in sqKm)']>10000].shape

(19, 5)

질문3. 이번에는 인구 밀도가 가장 높은 도시를 찾아봅시다.
답안은 데이터에 적힌 이름을 그대로 입력해 주세요. (예시: Seoul)

In [18]:
df['density'] = df['Population']/df['Land area (in sqKm)']
df.sort_values(by='density', ascending=False)

,Unnamed: 0,City / Urban area,Country,Population,Land area (in sqKm),density
75,75,Mumbai,India,14350000,484,29648.760331
74,74,Kolkata,India,12700000,531,23917.137476
101,101,Karachi,Pakistan,9800000,518,18918.918919
99,99,Lagos,Nigeria,13400000,738,18157.181572
34,34,Shenzhen,China,8000000,466,17167.381974
...,...,...,...,...,...,...
194,195,Chattanooga,USA,344000,751,458.055925
223,224,Asheville,USA,222000,536,414.179104
57,57,Pau,France,181000,450,402.222222
220,221,Hickory,USA,188000,546,344.322344
196,197,Barnstable Town,USA,244000,741,329.284750